# Pandas - Selecting a single Column

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(88)

df = pd.DataFrame(data = np.random.randn(6,5), index = 'A B C D E F'.split(), columns = 'VALUE1 VALUE2 VALUE3 VALUE4 VALUE5'.split())
df

     VALUE1    VALUE2    VALUE3    VALUE4    VALUE5
A  0.106884  2.205815  0.956563  0.068411  1.068514
B  0.997183 -0.931548  0.730430 -0.171214 -1.288691
C  1.061436 -0.040501 -0.903721 -1.554133 -0.951133
D  0.200526 -0.747329  1.068081 -0.277024  0.086557
E -0.253221 -1.212041  0.277273  0.552219 -0.467743
F -1.427493  0.885805  2.360634 -1.522006 -0.215945

In [3]:
df['VALUE1']

A    0.106884
B    0.997183
C    1.061436
D    0.200526
E   -0.253221
F   -1.427493
Name: VALUE1, dtype: float64

In [4]:
df.VALUE1

A    0.106884
B    0.997183
C    1.061436
D    0.200526
E   -0.253221
F   -1.427493
Name: VALUE1, dtype: float64

In [5]:
df['VALUE1'].values

array([ 0.1068843 ,  0.99718264,  1.06143594,  0.20052589, -0.25322081,
       -1.42749266])

In [6]:
df[['VALUE1']]

     VALUE1
A  0.106884
B  0.997183
C  1.061436
D  0.200526
E -0.253221
F -1.427493

In [7]:
df[['VALUE1']]['B':'D']

     VALUE1
B  0.997183
C  1.061436
D  0.200526

In [8]:
df[['VALUE1']][1:4]

     VALUE1
B  0.997183
C  1.061436
D  0.200526

# Element Selection with Multiple Columns

In [9]:
df[['VALUE2', 'VALUE5']]

     VALUE2    VALUE5
A  2.205815  1.068514
B -0.931548 -1.288691
C -0.040501 -0.951133
D -0.747329  0.086557
E -1.212041 -0.467743
F  0.885805 -0.215945

In [10]:
variable = df[['VALUE3', 'VALUE5']]
variable

     VALUE3    VALUE5
A  0.956563  1.068514
B  0.730430 -1.288691
C -0.903721 -0.951133
D  1.068081  0.086557
E  0.277273 -0.467743
F  2.360634 -0.215945

In [11]:
variable = ['VALUE3', 'VALUE1']
variable

['VALUE3', 'VALUE1']

In [12]:
df[variable]

     VALUE3    VALUE1
A  0.956563  0.106884
B  0.730430  0.997183
C -0.903721  1.061436
D  1.068081  0.200526
E  0.277273 -0.253221
F  2.360634 -1.427493

In [13]:
df

     VALUE1    VALUE2    VALUE3    VALUE4    VALUE5
A  0.106884  2.205815  0.956563  0.068411  1.068514
B  0.997183 -0.931548  0.730430 -0.171214 -1.288691
C  1.061436 -0.040501 -0.903721 -1.554133 -0.951133
D  0.200526 -0.747329  1.068081 -0.277024  0.086557
E -0.253221 -1.212041  0.277273  0.552219 -0.467743
F -1.427493  0.885805  2.360634 -1.522006 -0.215945

In [14]:
df['B':'D']

     VALUE1    VALUE2    VALUE3    VALUE4    VALUE5
B  0.997183 -0.931548  0.730430 -0.171214 -1.288691
C  1.061436 -0.040501 -0.903721 -1.554133 -0.951133
D  0.200526 -0.747329  1.068081 -0.277024  0.086557

In [15]:
df[1:4]

     VALUE1    VALUE2    VALUE3    VALUE4    VALUE5
B  0.997183 -0.931548  0.730430 -0.171214 -1.288691
C  1.061436 -0.040501 -0.903721 -1.554133 -0.951133
D  0.200526 -0.747329  1.068081 -0.277024  0.086557

In [16]:
df['E']

KeyError: 'E'

In [17]:
df['E':'E']

     VALUE1    VALUE2    VALUE3    VALUE4    VALUE5
E -0.253221 -1.212041  0.277273  0.552219 -0.467743

In [18]:
df['E':'E'][['VALUE2', 'VALUE5']]

     VALUE2    VALUE5
E -1.212041 -0.467743